Ran Plan for 2 projects:

1. dir: `terraform/applications/dfuchs-test` workspace: `default`
1. dir: `terraform/applications/noteburst` workspace: `default`
---

### 1. dir: `terraform/applications/dfuchs-test` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.org.data.sentry_organization.rubin: Reading...
module.org.data.sentry_organization.rubin: Read complete after 2s [id=rubin-observatory]
module.org.data.sentry_team.square: Reading...
module.org.data.sentry_team.square: Read complete after 0s [id=square]
module.alert["idfprod"].data.sentry_organization_integration.slack: Reading...
module.alert["usdfdev"].data.sentry_organization_integration.slack: Reading...
module.alert["usdfint"].data.sentry_organization_integration.slack: Reading...
module.alert["idfint"].data.sentry_organization_integration.slack: Reading...
module.alert["idfdev"].data.sentry_organization_integration.slack: Reading...
module.alert["usdfint"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert["idfprod"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert["idfint"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert["idfdev"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]
module.alert["usdfdev"].data.sentry_organization_integration.slack: Read complete after 1s [id=270749]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # sentry_project.project will be created
+ resource "sentry_project" "project" {
      + client_security       = (known after apply)
      + default_rules         = false
      + digests_max_delay     = (known after apply)
      + digests_min_delay     = (known after apply)
      + features              = (known after apply)
      + filters               = (known after apply)
      + fingerprinting_rules  = (known after apply)
      + grouping_enhancements = (known after apply)
      + id                    = (known after apply)
      + internal_id           = (known after apply)
      + name                  = "dfuchs-test"
      + organization          = "rubin-observatory"
      + platform              = "python"
      + resolve_age           = (known after apply)
      + slug                  = (known after apply)
      + teams                 = [
          + "square",
        ]
    }

  # module.alert["idfdev"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-dev-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
          + {
              + reappeared_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "idfdev"
      + filter_match  = "any"
      + frequency     = 15
      + id            = (known after apply)
      + name          = "New and unresolved - idfdev"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.alert["idfint"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-int-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
          + {
              + reappeared_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "idfint"
      + filter_match  = "any"
      + frequency     = 15
      + id            = (known after apply)
      + name          = "New and unresolved - idfint"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.alert["idfprod"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
          + {
              + reappeared_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "idfprod"
      + filter_match  = "any"
      + frequency     = 15
      + id            = (known after apply)
      + name          = "New and unresolved - idfprod"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.alert["usdfdev"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-dev"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
          + {
              + reappeared_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "usdfdev"
      + filter_match  = "any"
      + frequency     = 15
      + id            = (known after apply)
      + name          = "New and unresolved - usdfdev"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.alert["usdfint"].sentry_issue_alert.alert will be created
+ resource "sentry_issue_alert" "alert" {
      + action_match  = "any"
      + actions_v2    = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-int"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + conditions_v2 = [
          + {
              + first_seen_event = {
                  + name = (known after apply)
                }
            },
          + {
              + regression_event = {
                  + name = (known after apply)
                }
            },
          + {
              + reappeared_event = {
                  + name = (known after apply)
                }
            },
        ]
      + environment   = "usdfint"
      + filter_match  = "any"
      + frequency     = 15
      + id            = (known after apply)
      + name          = "New and unresolved - usdfint"
      + organization  = "rubin-observatory"
      + project       = (known after apply)
    }

  # module.alert["idfdev"].module.environment.data.sentry_key.first will be read during apply
  # (config refers to values not yet known)
 <= data "sentry_key" "first" {
      + dsn                      = (known after apply)
      + dsn_csp                  = (known after apply)
      + dsn_public               = (known after apply)
      + dsn_secret               = (known after apply)
      + javascript_loader_script = (known after apply)
      + organization             = "rubin-observatory"
      + project                  = (known after apply)
      + project_id               = (known after apply)
      + public                   = (known after apply)
      + rate_limit_count         = (known after apply)
      + rate_limit_window        = (known after apply)
      + secret                   = (known after apply)
    }

  # module.alert["idfdev"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfdev",
        ]
    }

  # module.alert["idfint"].module.environment.data.sentry_key.first will be read during apply
  # (config refers to values not yet known)
 <= data "sentry_key" "first" {
      + dsn                      = (known after apply)
      + dsn_csp                  = (known after apply)
      + dsn_public               = (known after apply)
      + dsn_secret               = (known after apply)
      + javascript_loader_script = (known after apply)
      + organization             = "rubin-observatory"
      + project                  = (known after apply)
      + project_id               = (known after apply)
      + public                   = (known after apply)
      + rate_limit_count         = (known after apply)
      + rate_limit_window        = (known after apply)
      + secret                   = (known after apply)
    }

  # module.alert["idfint"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfint",
        ]
    }

  # module.alert["idfprod"].module.environment.data.sentry_key.first will be read during apply
  # (config refers to values not yet known)
 <= data "sentry_key" "first" {
      + dsn                      = (known after apply)
      + dsn_csp                  = (known after apply)
      + dsn_public               = (known after apply)
      + dsn_secret               = (known after apply)
      + javascript_loader_script = (known after apply)
      + organization             = "rubin-observatory"
      + project                  = (known after apply)
      + project_id               = (known after apply)
      + public                   = (known after apply)
      + rate_limit_count         = (known after apply)
      + rate_limit_window        = (known after apply)
      + secret                   = (known after apply)
    }

  # module.alert["idfprod"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfprod",
        ]
    }

  # module.alert["usdfdev"].module.environment.data.sentry_key.first will be read during apply
  # (config refers to values not yet known)
 <= data "sentry_key" "first" {
      + dsn                      = (known after apply)
      + dsn_csp                  = (known after apply)
      + dsn_public               = (known after apply)
      + dsn_secret               = (known after apply)
      + javascript_loader_script = (known after apply)
      + organization             = "rubin-observatory"
      + project                  = (known after apply)
      + project_id               = (known after apply)
      + public                   = (known after apply)
      + rate_limit_count         = (known after apply)
      + rate_limit_window        = (known after apply)
      + secret                   = (known after apply)
    }

  # module.alert["usdfdev"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfdev",
        ]
    }

  # module.alert["usdfint"].module.environment.data.sentry_key.first will be read during apply
  # (config refers to values not yet known)
 <= data "sentry_key" "first" {
      + dsn                      = (known after apply)
      + dsn_csp                  = (known after apply)
      + dsn_public               = (known after apply)
      + dsn_secret               = (known after apply)
      + javascript_loader_script = (known after apply)
      + organization             = "rubin-observatory"
      + project                  = (known after apply)
      + project_id               = (known after apply)
      + public                   = (known after apply)
      + rate_limit_count         = (known after apply)
      + rate_limit_window        = (known after apply)
      + secret                   = (known after apply)
    }

  # module.alert["usdfint"].module.environment.terraform_data.environment will be created
+ resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfint",
        ]
    }

Plan: 11 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/applications/dfuchs-test
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://roundtable-dev.lsst.cloud/atlantis/lock?id=lsst-sqre%252Fprodromos%252Fterraform%252Fapplications%252Fdfuchs-test%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/applications/dfuchs-test
  ```
Plan: 11 to add, 0 to change, 0 to destroy.

---
### 2. dir: `terraform/applications/noteburst` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis/bin/terraform1.11.4 plan -input=false -refresh -out "/atlantis/repos/lsst-sqre/prodromos/7/default/terraform/applications/noteburst/default.tfplan"' in '/atlantis/repos/lsst-sqre/prodromos/7/default/terraform/applications/noteburst': exit status 1
module.org.data.sentry_organization.rubin: Reading...
module.new_unresolved_alert["idfint"].sentry_issue_alert.alert: Refreshing state... [id=15904586]
module.new_unresolved_alert["usdfint"].sentry_issue_alert.alert: Refreshing state... [id=15904591]
module.new_unresolved_alert["idfdev"].sentry_issue_alert.alert: Refreshing state... [id=15904590]
module.new_unresolved_alert["usdfprod"].sentry_issue_alert.alert: Refreshing state... [id=15904587]
module.new_unresolved_alert["idfprod"].sentry_issue_alert.alert: Refreshing state... [id=15904588]
module.new_unresolved_alert["usdfdev"].sentry_issue_alert.alert: Refreshing state... [id=15904589]
module.org.data.sentry_organization.rubin: Read complete after 1s [id=rubin-observatory]
module.org.data.sentry_team.square: Reading...
module.org.data.sentry_team.square: Read complete after 2s [id=square]
sentry_project.project: Refreshing state... [id=noteburst]
module.alert_renotify["idfprod"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["usdfdev"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["idfint"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["usdfint"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["idfdev"].data.sentry_organization_integration.slack: Reading...
module.alert_renotify["usdfdev"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["idfdev"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["idfprod"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["usdfint"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["idfint"].data.sentry_organization_integration.slack: Read complete after 0s [id=270749]
module.alert_renotify["usdfdev"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["usdfint"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfint"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfprod"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfdev"].module.environment.data.sentry_key.first: Reading...
module.alert_renotify["idfint"].module.environment.data.sentry_key.first: Read complete after 1s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["usdfint"].module.environment.data.sentry_key.first: Read complete after 1s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["idfprod"].module.environment.data.sentry_key.first: Read complete after 1s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["idfdev"].module.environment.data.sentry_key.first: Read complete after 1s [id=d9e033ecb88d80c56b3dfbc8b1f97855]
module.alert_renotify["usdfdev"].module.environment.data.sentry_key.first: Read complete after 3s [id=d9e033ecb88d80c56b3dfbc8b1f97855]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.alert_renotify["idfdev"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-dev-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "idfdev"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - idfdev"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["idfint"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-int-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "idfint"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - idfint"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["idfprod"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-data-lsst-cloud"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "idfprod"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - idfprod"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["usdfdev"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-dev"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "usdfdev"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - usdfdev"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["usdfint"].sentry_issue_alert.alert will be created
  + resource "sentry_issue_alert" "alert" {
      + action_match = "any"
      + actions_v2   = [
          + {
              + slack_notify_service = {
                  + channel    = "#status-usdf-rsp-int"
                  + channel_id = (known after apply)
                  + name       = (known after apply)
                  + tags       = []
                  + workspace  = "270749"
                }
            },
        ]
      + environment  = "usdfint"
      + filter_match = "any"
      + frequency    = 15
      + id           = (known after apply)
      + name         = "Every event (once per 15 minutes) - usdfint"
      + organization = "rubin-observatory"
      + project      = "noteburst"
    }

  # module.alert_renotify["idfdev"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfdev",
        ]
    }

  # module.alert_renotify["idfint"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfint",
        ]
    }

  # module.alert_renotify["idfprod"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "idfprod",
        ]
    }

  # module.alert_renotify["usdfdev"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfdev",
        ]
    }

  # module.alert_renotify["usdfint"].module.environment.terraform_data.environment will be created
  + resource "terraform_data" "environment" {
      + id               = (known after apply)
      + triggers_replace = [
          + "usdfint",
        ]
    }

Plan: 10 to add, 0 to change, 0 to destroy.
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵
╷
│ Error: Not found
│ 
│ No matching issue alert found
╵


```
</details>

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```